n3tk0/ESP32_Logger/src/managers/ConfigManager.cpp
#include "ConfigManager.h"
#include "../core/Globals.h"
#include "../core/ModuleRegistry.h"     // Pass 5: shadow modules.json on save
#include "../pipeline/DataPipeline.h"   // fsMutex
#include "../utils/MutexGuard.h"
#include <LittleFS.h>
#include "esp_mac.h"
#include <math.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>

// Safe strcpy — always null-terminates (N25)
#define SAFE_STRCPY(dst, src) do { strncpy(dst, src, sizeof(dst) - 1); dst[sizeof(dst) - 1] = '\0'; } while(0)
// ============================================================================
// INTERNAL: apply safe defaults to any zero/empty fields
// Called after every load path so partially-migrated or corrupt-but-recoverable
// configs always surface sane values to the web UI.
// ============================================================================
// Exposed in ConfigManager.h as `fillConfigDefaults()`; kept here under the
// original internal name so existing call sites compile unchanged via the
// thin wrapper at the bottom of the file.
static void applyDefaults() {
    auto badFloat = [](float v){ return v <= 0.0f || !isfinite(v); };

    // ── Flow meter ────────────────────────────────────────────────────────────
    if (badFloat(config.flowMeter.pulsesPerLiter))            config.flowMeter.pulsesPerLiter            = 450.0f;
    if (badFloat(config.flowMeter.calibrationMultiplier))     config.flowMeter.calibrationMultiplier     = 1.0f;
    // Obsolete window settings removed
    if (config.flowMeter.blinkDuration             <= 0) config.flowMeter.blinkDuration             = 250;

    // ── Hardware ──────────────────────────────────────────────────────────────
    if (config.hardware.cpuFreqMHz  <= 0) config.hardware.cpuFreqMHz  = 80;
    if (config.hardware.debounceMs  == 0) config.hardware.debounceMs  = 100;

    // ── Datalog ───────────────────────────────────────────────────────────────
    if (badFloat(config.datalog.pfToFfThreshold)) config.datalog.pfToFfThreshold = 4.5f;
    if (badFloat(config.datalog.ffToPfThreshold)) config.datalog.ffToPfThreshold = 3.7f;
    if (config.datalog.maxSizeKB       == 0) config.datalog.maxSizeKB       = 1024;
    
    if (config.datalog.maxEntries == 0) config.datalog.maxEntries = 10000;
    
    if (config.datalog.manualPressThresholdMs == 0) config.datalog.manualPressThresholdMs = 500;
    if (!strlen(config.datalog.prefix))       SAFE_STRCPY(config.datalog.prefix,      DEFAULT_DATALOG_PREFIX);
    if (!strlen(config.datalog.currentFile))  SAFE_STRCPY(config.datalog.currentFile, "/datalog.txt");

    // ── Logger (wide-CSV pipeline, v13) ─────────────────────────────────────
    if (config.logger.aggregationIntervalSec == 0)
        config.logger.aggregationIntervalSec = 60;
    if (config.logger.aggregationIntervalSec > 3600)
        config.logger.aggregationIntervalSec = 3600;

    // ── Network ───────────────────────────────────────────────────────────────
    if (!strlen(config.network.apSSID))     SAFE_STRCPY(config.network.apSSID,    DEFAULT_AP_SSID);
    if (!strlen(config.network.apPassword)) SAFE_STRCPY(config.network.apPassword, DEFAULT_AP_PASSWORD);
    if (!strlen(config.network.ntpServer)) SAFE_STRCPY(config.network.ntpServer, DEFAULT_NTP_SERVER);
    // Clamp out-of-range time offsets from a corrupted/migrated config. Note
    // timezone 0 is a valid value (UTC), so we only reset values outside the
    // real-world range rather than treating 0 as "unset".
    if (config.network.timezone < -12 || config.network.timezone > 14) config.network.timezone = 2;
    if (config.network.dstOffsetHours < 0 || config.network.dstOffsetHours > 2) config.network.dstOffsetHours = 0;

    if (!config.network.apIP[0]) {
        config.network.apIP[0]=192; config.network.apIP[1]=168;
        config.network.apIP[2]=4;   config.network.apIP[3]=1;
    }
    if (!config.network.apGateway[0]) {
        config.network.apGateway[0]=192; config.network.apGateway[1]=168;
        config.network.apGateway[2]=4;   config.network.apGateway[3]=1;
    }
    if (!config.network.apSubnet[0]) {
        config.network.apSubnet[0]=255; config.network.apSubnet[1]=255;
        config.network.apSubnet[2]=255; config.network.apSubnet[3]=0;
    }
    if (!config.network.subnet[0]) {
        config.network.subnet[0]=255; config.network.subnet[1]=255;
        config.network.subnet[2]=255; config.network.subnet[3]=0;
    }
    if (!config.network.staticIP[0]) {
        config.network.staticIP[0]=192; config.network.staticIP[1]=168;
        config.network.staticIP[2]=4;   config.network.staticIP[3]=100;
    }
    if (!config.network.gateway[0]) {
        config.network.gateway[0]=192; config.network.gateway[1]=168;
        config.network.gateway[2]=4;   config.network.gateway[3]=1;
    }
    if (!config.network.dns[0]) {
        config.network.dns[0]=8; config.network.dns[1]=8;
        config.network.dns[2]=8; config.network.dns[3]=8;
    }

    // ── Identity ──────────────────────────────────────────────────────────────
    if (!strlen(config.deviceName)) SAFE_STRCPY(config.deviceName, "Water Logger");

    // ── Theme ─────────────────────────────────────────────────────────────────
    if (!strlen(config.theme.primaryColor))      SAFE_STRCPY(config.theme.primaryColor,      "#275673");
    if (!strlen(config.theme.secondaryColor))    SAFE_STRCPY(config.theme.secondaryColor,    "#4a5568");
    if (!strlen(config.theme.accentColor))       SAFE_STRCPY(config.theme.accentColor,       "#3182ce");
    if (!strlen(config.theme.lightBgColor))      SAFE_STRCPY(config.theme.lightBgColor,      "#f0f2f5");
    if (!strlen(config.theme.lightTextColor))    SAFE_STRCPY(config.theme.lightTextColor,    "#2d3748");
    if (!strlen(config.theme.darkBgColor))       SAFE_STRCPY(config.theme.darkBgColor,       "#0f172a");
    if (!strlen(config.theme.darkTextColor))     SAFE_STRCPY(config.theme.darkTextColor,     "#e2e8f0");
    if (!strlen(config.theme.ffColor))           SAFE_STRCPY(config.theme.ffColor,           "#275673");
    if (!strlen(config.theme.pfColor))           SAFE_STRCPY(config.theme.pfColor,           "#7eb0d5");
    if (!strlen(config.theme.otherColor))        SAFE_STRCPY(config.theme.otherColor,        "#a0aec0");
    if (!strlen(config.theme.storageBarColor))   SAFE_STRCPY(config.theme.storageBarColor,   "#27ae60");
    if (!strlen(config.theme.storageBar70Color)) SAFE_STRCPY(config.theme.storageBar70Color, "#f39c12");
    if (!strlen(config.theme.storageBar90Color)) SAFE_STRCPY(config.theme.storageBar90Color, "#e74c3c");
    if (!strlen(config.theme.storageBarBorder))  SAFE_STRCPY(config.theme.storageBarBorder,  "#cccccc");
    if (!strlen(config.theme.chartLocalPath))    SAFE_STRCPY(config.theme.chartLocalPath,    "/uPlot.iife.min.js");
}

// ============================================================================
// SANITIZE WAKE CONFIG
// ============================================================================
static bool sanitizeWakeConfig() {
#if CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32S2
    auto isRtcWakePin = [](uint8_t pin) -> bool { return pin <= 21; };
    auto isSafePin    = [](uint8_t pin) -> bool { return pin <= 48; };
#elif CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6
    auto isRtcWakePin = [](uint8_t pin) -> bool { return pin <= 5; };
    auto isSafePin    = [](uint8_t pin) -> bool { return pin <= 21 && !(pin >= 11 && pin <= 17); };
#elif CONFIG_IDF_TARGET_ESP32
    // Original ESP32: RTC wake GPIOs go up to 39; avoid internal flash pins 6-11.
    auto isRtcWakePin = [](uint8_t pin) -> bool { return pin <= 39 && !(pin >= 6 && pin <= 11); };
    auto isSafePin    = [](uint8_t pin) -> bool { return pin <= 39 && !(pin >= 6 && pin <= 11); };
#else
    // Unknown target: use permissive limits to avoid false-positive resets.
    auto isRtcWakePin = [](uint8_t pin) -> bool { return pin <= 39; };
    auto isSafePin    = [](uint8_t pin) -> bool { return pin <= 48; };
#endif

